app/controllers/users_controller.rb

INSERT INTO "users" ("username", "session_token", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["username", "hello_2"], ["session_token", "[FILTERED]"], ["password_digest", "[FILTERED]"], ["created_at", "2022-09-23 23:27:37.185407"], ["updated_at", "2022-09-23 23:27:37.185407"]]
---
    def create
        @user = User.new(user_params)
        if @user && @user.save