app/models/user.rb

    def self.find_by_credentials(username, password)
        @user = User.find_by_username(username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mitchell"], ["LIMIT", 1]]